powerfull/src/Documents/РеализацияУслуг/РеализацияУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияУслуг</name>
  <basedOn>Document.ЗаписьКлиента</basedOn>
  <registerRecords>AccumulationRegister.ПродажаУслуг</registerRecords>
  <registerRecords>AccumulationRegister.ДеньгиОтПродажиУслугИАбонементов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Запись</name>
    <type>
      <types>DocumentRef.ЗаписьКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.Оплата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОказываемыеУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

powerfull/src/Documents/РеализацияУслуг/ManagerModule.bsl
Процедура РеализацияУслуг(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РеализацияУслуг)
	Макет = Документы.РеализацияУслуг.ПолучитьМакет("РеализацияУслуг");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияУслуг.Дата,
	|	РеализацияУслуг.Клиент,
	|	РеализацияУслуг.Номер,
	|	РеализацияУслуг.СуммаДокумента,
	|	РеализацияУслуг.Тренер,
	|	РеализацияУслуг.ОказываемыеУслуги.(
	|		НомерСтроки,
	|		Услуга,
	|		Цена
	|	)
	|ИЗ
	|	Документ.РеализацияУслуг КАК РеализацияУслуг
	|ГДЕ
	|	РеализацияУслуг.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОказываемыеУслугиШапка = Макет.ПолучитьОбласть("ОказываемыеУслугиШапка");
	ОбластьОказываемыеУслуги = Макет.ПолучитьОбласть("ОказываемыеУслуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ЗначенияПараметров = Новый Структура;
		ЗначенияПараметров.Вставить("Клиент", Выборка.Клиент);
		ЗначенияПараметров.Вставить("Тренер", Выборка.Тренер);
		ЗначенияПараметров.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D"));
		ЗначенияПараметров.Вставить("Номер", УдалитьЛидирующиеНули(Выборка.Номер));
		ЗначенияПараметров.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
		ЗначенияПараметров.Вставить("СуммаПрописью", СуммаПрописью(Выборка.СуммаДокумента));
		
		ОбластьЗаголовок.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(ЗначенияПараметров);				
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОказываемыеУслугиШапка);
		ВыборкаОказываемыеУслуги = Выборка.ОказываемыеУслуги.Выбрать();
		Пока ВыборкаОказываемыеУслуги.Следующий() Цикл
			ОбластьОказываемыеУслуги.Параметры.Заполнить(ВыборкаОказываемыеУслуги);
			ТабДок.Вывести(ОбластьОказываемыеУслуги, ВыборкаОказываемыеУслуги.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Функция УдалитьЛидирующиеНули(Знач Номер)
	
	Пока СтрНачинаетсяС(Номер, "0") Цикл
		  Номер = Сред(Номер, 2);
	КонецЦикла;
	  
	Возврат Номер;
	
КонецФункции

Функция СуммаПрописью(СуммаДокумента)
	
	ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
	Возврат ЧислоПрописью(СуммаДокумента,, ПарПредмета);
		
КонецФункции
